gentilkiwi/st25tb_kiemul/driverlib/MSP430FR2xx_4xx/lcd_e.h
//*****************************************************************************
//
// lcd_e.h - Driver for the LCD_E Module.
//
//*****************************************************************************

#ifndef __MSP430WARE_LCD_E_H__
#define __MSP430WARE_LCD_E_H__

#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_LCD_E__

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

#include "inc/hw_memmap.h"
//*****************************************************************************
//
//! \brief Used in the LCD_E_init() function as the initParams parameter.
//
//*****************************************************************************
typedef struct LCD_E_initParam {
    //! Selects the clock that will be used by the LCD_E.
    //! \n Valid values are:
    //! - \b LCD_E_CLOCKSOURCE_XTCLK [Default]
    //! - \b LCD_E_CLOCKSOURCE_ACLK [Default]
    //! - \b LCD_E_CLOCKSOURCE_VLOCLK
    uint16_t clockSource;
    //! Selects the divider for LCD_E frequency.
    //! \n Valid values are:
    //! - \b LCD_E_CLOCKDIVIDER_1 [Default]
    //! - \b LCD_E_CLOCKDIVIDER_2
    //! - \b LCD_E_CLOCKDIVIDER_3
    //! - \b LCD_E_CLOCKDIVIDER_4
    //! - \b LCD_E_CLOCKDIVIDER_5
    //! - \b LCD_E_CLOCKDIVIDER_6
    //! - \b LCD_E_CLOCKDIVIDER_7
    //! - \b LCD_E_CLOCKDIVIDER_8
    //! - \b LCD_E_CLOCKDIVIDER_9
    //! - \b LCD_E_CLOCKDIVIDER_10
    //! - \b LCD_E_CLOCKDIVIDER_11
    //! - \b LCD_E_CLOCKDIVIDER_12
    //! - \b LCD_E_CLOCKDIVIDER_13
    //! - \b LCD_E_CLOCKDIVIDER_14
    //! - \b LCD_E_CLOCKDIVIDER_15
    //! - \b LCD_E_CLOCKDIVIDER_16
    //! - \b LCD_E_CLOCKDIVIDER_17
    //! - \b LCD_E_CLOCKDIVIDER_18
    //! - \b LCD_E_CLOCKDIVIDER_19
    //! - \b LCD_E_CLOCKDIVIDER_20
    //! - \b LCD_E_CLOCKDIVIDER_21
    //! - \b LCD_E_CLOCKDIVIDER_22
    //! - \b LCD_E_CLOCKDIVIDER_23
    //! - \b LCD_E_CLOCKDIVIDER_24
    //! - \b LCD_E_CLOCKDIVIDER_25
    //! - \b LCD_E_CLOCKDIVIDER_26
    //! - \b LCD_E_CLOCKDIVIDER_27
    //! - \b LCD_E_CLOCKDIVIDER_28
    //! - \b LCD_E_CLOCKDIVIDER_29
    //! - \b LCD_E_CLOCKDIVIDER_30
    //! - \b LCD_E_CLOCKDIVIDER_31
    //! - \b LCD_E_CLOCKDIVIDER_32
    uint16_t clockDivider;
    //! Selects LCD_E mux rate.
    //! \n Valid values are:
    //! - \b LCD_E_STATIC [Default]
    //! - \b LCD_E_2_MUX
    //! - \b LCD_E_3_MUX
    //! - \b LCD_E_4_MUX
    //! - \b LCD_E_5_MUX
    //! - \b LCD_E_6_MUX
    //! - \b LCD_E_7_MUX
    //! - \b LCD_E_8_MUX
    uint16_t muxRate;
    //! Selects LCD waveform mode.
    //! \n Valid values are:
    //! - \b LCD_E_STANDARD_WAVEFORMS [Default]
    //! - \b LCD_E_LOW_POWER_WAVEFORMS
    uint16_t waveforms;
    //! Sets LCD segment on/off.
    //! \n Valid values are:
    //! - \b LCD_E_SEGMENTS_DISABLED [Default]
    //! - \b LCD_E_SEGMENTS_ENABLED
    uint16_t segments;
} LCD_E_initParam;

extern const LCD_E_initParam LCD_E_INIT_PARAM;

//*****************************************************************************
//
// The following are values that can be passed to the initParams parameter for
// functions: LCD_E_init().
//
//*****************************************************************************
#define LCD_E_CLOCKSOURCE_XTCLK                                     (LCDSSEL_0)
#define LCD_E_CLOCKSOURCE_ACLK                                      (LCDSSEL_1)
#define LCD_E_CLOCKSOURCE_VLOCLK                                    (LCDSSEL_2)

//*****************************************************************************
//
// The following are values that can be passed to the initParams parameter for
// functions: LCD_E_init().
//
//*****************************************************************************
#define LCD_E_CLOCKDIVIDER_1                                         (LCDDIV_0)
#define LCD_E_CLOCKDIVIDER_2                                         (LCDDIV_1)
#define LCD_E_CLOCKDIVIDER_3                                         (LCDDIV_2)
#define LCD_E_CLOCKDIVIDER_4                                         (LCDDIV_3)
#define LCD_E_CLOCKDIVIDER_5                                         (LCDDIV_4)
#define LCD_E_CLOCKDIVIDER_6                                         (LCDDIV_5)
#define LCD_E_CLOCKDIVIDER_7                                         (LCDDIV_6)
#define LCD_E_CLOCKDIVIDER_8                                         (LCDDIV_7)
#define LCD_E_CLOCKDIVIDER_9                                         (LCDDIV_8)
#define LCD_E_CLOCKDIVIDER_10                                        (LCDDIV_9)
#define LCD_E_CLOCKDIVIDER_11                                       (LCDDIV_10)
#define LCD_E_CLOCKDIVIDER_12                                       (LCDDIV_11)
#define LCD_E_CLOCKDIVIDER_13                                       (LCDDIV_12)
#define LCD_E_CLOCKDIVIDER_14                                       (LCDDIV_13)
#define LCD_E_CLOCKDIVIDER_15                                       (LCDDIV_14)
#define LCD_E_CLOCKDIVIDER_16                                       (LCDDIV_15)
#define LCD_E_CLOCKDIVIDER_17                                       (LCDDIV_16)
#define LCD_E_CLOCKDIVIDER_18                                       (LCDDIV_17)
#define LCD_E_CLOCKDIVIDER_19                                       (LCDDIV_18)
#define LCD_E_CLOCKDIVIDER_20                                       (LCDDIV_19)
#define LCD_E_CLOCKDIVIDER_21                                       (LCDDIV_20)
#define LCD_E_CLOCKDIVIDER_22                                       (LCDDIV_21)
#define LCD_E_CLOCKDIVIDER_23                                       (LCDDIV_22)
#define LCD_E_CLOCKDIVIDER_24                                       (LCDDIV_23)
#define LCD_E_CLOCKDIVIDER_25                                       (LCDDIV_24)
#define LCD_E_CLOCKDIVIDER_26                                       (LCDDIV_25)
#define LCD_E_CLOCKDIVIDER_27                                       (LCDDIV_26)
#define LCD_E_CLOCKDIVIDER_28                                       (LCDDIV_27)
#define LCD_E_CLOCKDIVIDER_29                                       (LCDDIV_28)
#define LCD_E_CLOCKDIVIDER_30                                       (LCDDIV_29)
#define LCD_E_CLOCKDIVIDER_31                                       (LCDDIV_30)
#define LCD_E_CLOCKDIVIDER_32                                       (LCDDIV_31)

//*****************************************************************************
//
// The following are values that can be passed to the initParams parameter for
// functions: LCD_E_init().
//
//*****************************************************************************
#define LCD_E_STATIC                                                      (0x0)
#define LCD_E_2_MUX                                                    (LCDMX0)
#define LCD_E_3_MUX                                                    (LCDMX1)
#define LCD_E_4_MUX                                           (LCDMX1 | LCDMX0)
#define LCD_E_5_MUX                                                    (LCDMX2)
#define LCD_E_6_MUX                                           (LCDMX2 | LCDMX0)
#define LCD_E_7_MUX                                           (LCDMX2 | LCDMX1)
#define LCD_E_8_MUX                                  (LCDMX2 | LCDMX1 | LCDMX0)

//*****************************************************************************
//
// The following are values that can be passed to the initParams parameter for
// functions: LCD_E_init().
//
//*****************************************************************************
#define LCD_E_STANDARD_WAVEFORMS                                          (0x0)
#define LCD_E_LOW_POWER_WAVEFORMS                                       (LCDLP)

//*****************************************************************************
//
// The following are values that can be passed to the initParams parameter for
// functions: LCD_E_init().
//
//*****************************************************************************
#define LCD_E_SEGMENTS_DISABLED                                           (0x0)
#define LCD_E_SEGMENTS_ENABLED                                         (LCDSON)

//*****************************************************************************
//
// The following are values that can be passed to the mask parameter for
// functions: LCD_E_clearInterrupt(), LCD_E_getInterruptStatus(),
// LCD_E_enableInterrupt(), and LCD_E_disableInterrupt() as well as returned by
// the LCD_E_getInterruptStatus() function.
//
//*****************************************************************************
#define LCD_E_BLINKING_SEGMENTS_ON_INTERRUPT                       (LCDBLKONIE)
#define LCD_E_BLINKING_SEGMENTS_OFF_INTERRUPT                     (LCDBLKOFFIE)
#define LCD_E_FRAME_INTERRUPT                                        (LCDFRMIE)

//*****************************************************************************
//
// The following are values that can be passed to the displayMemory parameter
// for functions: LCD_E_selectDisplayMemory().
//
//*****************************************************************************
#define LCD_E_DISPLAYSOURCE_MEMORY                                        (0x0)
#define LCD_E_DISPLAYSOURCE_BLINKINGMEMORY                            (LCDDISP)

//*****************************************************************************
//
// The following are values that can be passed to the clockPrescalar parameter
// for functions: LCD_E_setBlinkingControl().
//
//*****************************************************************************
#define LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_4                                (0x0)
#define LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_8                         (LCDBLKPRE0)
#define LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_16                        (LCDBLKPRE1)
#define LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_32           (LCDBLKPRE1 | LCDBLKPRE0)
#define LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_64                        (LCDBLKPRE2)
#define LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_128          (LCDBLKPRE2 | LCDBLKPRE0)
#define LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_256          (LCDBLKPRE2 | LCDBLKPRE1)
#define LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_512                                  \
                                         (LCDBLKPRE2 | LCDBLKPRE1 | LCDBLKPRE0)

//*****************************************************************************
//
// The following are values that can be passed to the mode parameter for
// functions: LCD_E_setBlinkingControl().
//
//*****************************************************************************
#define LCD_E_BLINK_MODE_DISABLED                                 (LCDBLKMOD_0)
#define LCD_E_BLINK_MODE_INDIVIDUAL_SEGMENTS                      (LCDBLKMOD_1)
#define LCD_E_BLINK_MODE_ALL_SEGMENTS                             (LCDBLKMOD_2)
#define LCD_E_BLINK_MODE_SWITCHING_BETWEEN_DISPLAY_CONTENTS       (LCDBLKMOD_3)

//*****************************************************************************
//
// The following are values that can be passed to the r13Source parameter for
// functions: LCD_E_setVLCDSource().
//
//*****************************************************************************
#define LCD_E_NON_INTERNAL_REFERENCE_VOLTAGE                              (0x0)
#define LCD_E_INTERNAL_REFERENCE_VOLTAGE                             (LCDREFEN)

//*****************************************************************************
//
// The following are values that can be passed to the r33Source parameter for
// functions: LCD_E_setVLCDSource().
//
//*****************************************************************************
#define LCD_E_EXTERNAL_SUPPLY_VOLTAGE                                     (0x0)
#define LCD_E_INTERNAL_SUPPLY_VOLTAGE                               (LCDSELVDD)

//*****************************************************************************
//
// The following are values that can be passed to the voltage parameter for
// functions: LCD_E_setVLCDVoltage().
//
//*****************************************************************************
#define LCD_E_REFERENCE_VOLTAGE_2_60V                                     (0x0)
#define LCD_E_REFERENCE_VOLTAGE_2_66V                                   (VLCD0)
#define LCD_E_REFERENCE_VOLTAGE_2_72V                                   (VLCD1)
#define LCD_E_REFERENCE_VOLTAGE_2_78V                           (VLCD1 | VLCD0)
#define LCD_E_REFERENCE_VOLTAGE_2_84V                                   (VLCD2)
#define LCD_E_REFERENCE_VOLTAGE_2_90V                           (VLCD2 | VLCD0)
#define LCD_E_REFERENCE_VOLTAGE_2_96V                           (VLCD2 | VLCD1)
#define LCD_E_REFERENCE_VOLTAGE_3_02V                   (VLCD2 | VLCD1 | VLCD0)
#define LCD_E_REFERENCE_VOLTAGE_3_08V                                   (VLCD3)
#define LCD_E_REFERENCE_VOLTAGE_3_14V                           (VLCD3 | VLCD0)
#define LCD_E_REFERENCE_VOLTAGE_3_20V                           (VLCD3 | VLCD1)
#define LCD_E_REFERENCE_VOLTAGE_3_26V                   (VLCD3 | VLCD1 | VLCD0)
#define LCD_E_REFERENCE_VOLTAGE_3_32V                           (VLCD3 | VLCD2)
#define LCD_E_REFERENCE_VOLTAGE_3_38V                   (VLCD3 | VLCD2 | VLCD0)
#define LCD_E_REFERENCE_VOLTAGE_3_44V                   (VLCD3 | VLCD2 | VLCD1)
#define LCD_E_REFERENCE_VOLTAGE_3_50V           (VLCD3 | VLCD2 | VLCD1 | VLCD0)

//*****************************************************************************
//
// The following are values that can be passed to the startPin parameter for
// functions: LCD_E_setPinAsLCDFunctionEx(); the endPin parameter for
// functions: LCD_E_setPinAsLCDFunctionEx(); the pin parameter for functions:
// LCD_E_setPinAsLCDFunction(), LCD_E_setPinAsPortFunction(),
// LCD_E_setPinAsCOM(), and LCD_E_setPinAsSEG().
//
//*****************************************************************************
#define LCD_E_SEGMENT_LINE_0                                                (0)
#define LCD_E_SEGMENT_LINE_1                                                (1)
#define LCD_E_SEGMENT_LINE_2                                                (2)
#define LCD_E_SEGMENT_LINE_3                                                (3)
#define LCD_E_SEGMENT_LINE_4                                                (4)
#define LCD_E_SEGMENT_LINE_5                                                (5)
#define LCD_E_SEGMENT_LINE_6                                                (6)
#define LCD_E_SEGMENT_LINE_7                                                (7)
#define LCD_E_SEGMENT_LINE_8                                                (8)
#define LCD_E_SEGMENT_LINE_9                                                (9)
#define LCD_E_SEGMENT_LINE_10                                              (10)
#define LCD_E_SEGMENT_LINE_11                                              (11)
#define LCD_E_SEGMENT_LINE_12                                              (12)
#define LCD_E_SEGMENT_LINE_13                                              (13)
#define LCD_E_SEGMENT_LINE_14                                              (14)
#define LCD_E_SEGMENT_LINE_15                                              (15)
#define LCD_E_SEGMENT_LINE_16                                              (16)
#define LCD_E_SEGMENT_LINE_17                                              (17)
#define LCD_E_SEGMENT_LINE_18                                              (18)
#define LCD_E_SEGMENT_LINE_19                                              (19)
#define LCD_E_SEGMENT_LINE_20                                              (20)
#define LCD_E_SEGMENT_LINE_21                                              (21)
#define LCD_E_SEGMENT_LINE_22                                              (22)
#define LCD_E_SEGMENT_LINE_23                                              (23)
#define LCD_E_SEGMENT_LINE_24                                              (24)
#define LCD_E_SEGMENT_LINE_25                                              (25)
#define LCD_E_SEGMENT_LINE_26                                              (26)
#define LCD_E_SEGMENT_LINE_27                                              (27)
#define LCD_E_SEGMENT_LINE_28                                              (28)
#define LCD_E_SEGMENT_LINE_29                                              (29)
#define LCD_E_SEGMENT_LINE_30                                              (30)
#define LCD_E_SEGMENT_LINE_31                                              (31)
#define LCD_E_SEGMENT_LINE_32                                              (32)
#define LCD_E_SEGMENT_LINE_33                                              (33)
#define LCD_E_SEGMENT_LINE_34                                              (34)
#define LCD_E_SEGMENT_LINE_35                                              (35)
#define LCD_E_SEGMENT_LINE_36                                              (36)
#define LCD_E_SEGMENT_LINE_37                                              (37)
#define LCD_E_SEGMENT_LINE_38                                              (38)
#define LCD_E_SEGMENT_LINE_39                                              (39)
#define LCD_E_SEGMENT_LINE_40                                              (40)
#define LCD_E_SEGMENT_LINE_41                                              (41)
#define LCD_E_SEGMENT_LINE_42                                              (42)
#define LCD_E_SEGMENT_LINE_43                                              (43)
#define LCD_E_SEGMENT_LINE_44                                              (44)
#define LCD_E_SEGMENT_LINE_45                                              (45)
#define LCD_E_SEGMENT_LINE_46                                              (46)
#define LCD_E_SEGMENT_LINE_47                                              (47)

//*****************************************************************************
//
// The following are values that can be passed to the memory parameter for
// functions: LCD_E_setMemory(), LCD_E_updateMemory(), LCD_E_toggleMemory(),
// LCD_E_clearMemory(), LCD_E_setBlinkingMemory(),
// LCD_E_updateBlinkingMemory(), LCD_E_toggleBlinkingMemory(), and
// LCD_E_clearBlinkingMemory().
//
//*****************************************************************************
#define LCD_E_MEMORY_BLINKINGMEMORY_0                                       (0)
#define LCD_E_MEMORY_BLINKINGMEMORY_1                                       (1)
#define LCD_E_MEMORY_BLINKINGMEMORY_2                                       (2)
#define LCD_E_MEMORY_BLINKINGMEMORY_3                                       (3)
#define LCD_E_MEMORY_BLINKINGMEMORY_4                                       (4)
#define LCD_E_MEMORY_BLINKINGMEMORY_5                                       (5)
#define LCD_E_MEMORY_BLINKINGMEMORY_6                                       (6)
#define LCD_E_MEMORY_BLINKINGMEMORY_7                                       (7)
#define LCD_E_MEMORY_BLINKINGMEMORY_8                                       (8)
#define LCD_E_MEMORY_BLINKINGMEMORY_9                                       (9)
#define LCD_E_MEMORY_BLINKINGMEMORY_10                                     (10)
#define LCD_E_MEMORY_BLINKINGMEMORY_11                                     (11)
#define LCD_E_MEMORY_BLINKINGMEMORY_12                                     (12)
#define LCD_E_MEMORY_BLINKINGMEMORY_13                                     (13)
#define LCD_E_MEMORY_BLINKINGMEMORY_14                                     (14)
#define LCD_E_MEMORY_BLINKINGMEMORY_15                                     (15)
#define LCD_E_MEMORY_BLINKINGMEMORY_16                                     (16)
#define LCD_E_MEMORY_BLINKINGMEMORY_17                                     (17)
#define LCD_E_MEMORY_BLINKINGMEMORY_18                                     (18)
#define LCD_E_MEMORY_BLINKINGMEMORY_19                                     (19)
#define LCD_E_MEMORY_BLINKINGMEMORY_20                                     (20)
#define LCD_E_MEMORY_BLINKINGMEMORY_21                                     (21)
#define LCD_E_MEMORY_BLINKINGMEMORY_22                                     (22)
#define LCD_E_MEMORY_BLINKINGMEMORY_23                                     (23)
#define LCD_E_MEMORY_BLINKINGMEMORY_24                                     (24)
#define LCD_E_MEMORY_BLINKINGMEMORY_25                                     (25)
#define LCD_E_MEMORY_BLINKINGMEMORY_26                                     (26)
#define LCD_E_MEMORY_BLINKINGMEMORY_27                                     (27)
#define LCD_E_MEMORY_BLINKINGMEMORY_28                                     (28)
#define LCD_E_MEMORY_BLINKINGMEMORY_29                                     (29)
#define LCD_E_MEMORY_BLINKINGMEMORY_30                                     (30)
#define LCD_E_MEMORY_BLINKINGMEMORY_31                                     (31)
#define LCD_E_MEMORY_BLINKINGMEMORY_32                                     (32)
#define LCD_E_MEMORY_BLINKINGMEMORY_33                                     (33)
#define LCD_E_MEMORY_BLINKINGMEMORY_34                                     (34)
#define LCD_E_MEMORY_BLINKINGMEMORY_35                                     (35)
#define LCD_E_MEMORY_BLINKINGMEMORY_36                                     (36)
#define LCD_E_MEMORY_BLINKINGMEMORY_37                                     (37)
#define LCD_E_MEMORY_BLINKINGMEMORY_38                                     (38)
#define LCD_E_MEMORY_BLINKINGMEMORY_39                                     (39)

//*****************************************************************************
//
// The following are values that can be passed to the com parameter for
// functions: LCD_E_setPinAsCOM().
//
//*****************************************************************************
#define LCD_E_MEMORY_COM0                                                (0x01)
#define LCD_E_MEMORY_COM1                                                (0x02)
#define LCD_E_MEMORY_COM2                                                (0x04)
#define LCD_E_MEMORY_COM3                                                (0x08)
#define LCD_E_MEMORY_COM4                                                (0x10)
#define LCD_E_MEMORY_COM5                                                (0x20)
#define LCD_E_MEMORY_COM6                                                (0x40)
#define LCD_E_MEMORY_COM7                                                (0x80)

//*****************************************************************************
//
// The following are values that can be passed to the freq parameter for
// functions: LCD_E_setChargePumpFreq().
//
//*****************************************************************************
#define LCD_E_CHARGEPUMP_FREQ_1                                        (0x0000)
#define LCD_E_CHARGEPUMP_FREQ_2                                    (LCDCPFSEL0)
#define LCD_E_CHARGEPUMP_FREQ_3                                    (LCDCPFSEL1)
#define LCD_E_CHARGEPUMP_FREQ_4                       (LCDCPFSEL1 | LCDCPFSEL0)
#define LCD_E_CHARGEPUMP_FREQ_5                                    (LCDCPFSEL2)
#define LCD_E_CHARGEPUMP_FREQ_6                       (LCDCPFSEL2 | LCDCPFSEL0)
#define LCD_E_CHARGEPUMP_FREQ_7                       (LCDCPFSEL2 | LCDCPFSEL1)
#define LCD_E_CHARGEPUMP_FREQ_8          (LCDCPFSEL2 | LCDCPFSEL1 | LCDCPFSEL0)
#define LCD_E_CHARGEPUMP_FREQ_9                                    (LCDCPFSEL3)
#define LCD_E_CHARGEPUMP_FREQ_10                      (LCDCPFSEL3 | LCDCPFSEL0)
#define LCD_E_CHARGEPUMP_FREQ_11                      (LCDCPFSEL3 | LCDCPFSEL1)
#define LCD_E_CHARGEPUMP_FREQ_12         (LCDCPFSEL3 | LCDCPFSEL1 | LCDCPFSEL0)
#define LCD_E_CHARGEPUMP_FREQ_13                      (LCDCPFSEL3 | LCDCPFSEL2)
#define LCD_E_CHARGEPUMP_FREQ_14         (LCDCPFSEL3 | LCDCPFSEL2 | LCDCPFSEL0)
#define LCD_E_CHARGEPUMP_FREQ_15         (LCDCPFSEL3 | LCDCPFSEL2 | LCDCPFSEL1)
#define LCD_E_CHARGEPUMP_FREQ_16                                              \
                            (LCDCPFSEL3 | LCDCPFSEL2 | LCDCPFSEL1 | LCDCPFSEL0)

