gentilkiwi/st25tb_kiemul/driverlib/MSP430FR2xx_4xx/lcd_e.h
//*****************************************************************************
//
// The following are values that can be passed to the mode parameter for
// functions: LCD_E_setReferenceMode().
//
//*****************************************************************************
#define LCD_E_REFERENCE_MODE_STATIC                                       (0x0)
#define LCD_E_REFERENCE_MODE_SWITCHED                              (LCDREFMODE)

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************

//*****************************************************************************
//
//! \brief Initializes the LCD_E Module.
//!
//! This function initializes the LCD_E but without turning on. It bascially
//! setup the clock source, clock divider, mux rate, low-power waveform and
//! segments on/off. After calling this function, user can enable/disable
//! charge pump, internal reference voltage, or pin SEG/COM configurations.
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param initParams is the pointer to LCD_InitParam structure. See the
//!        following parameters for each field.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_init(uint16_t baseAddress,
                       LCD_E_initParam *initParams);

//*****************************************************************************
//
//! \brief Turns on the LCD_E module.
//!
//! This function turns the LCD_E on.
//!
//! \param baseAddress is the base address of the LCD_E module.
//!
//! Modified bits are \b LCDPCTL of \b SYSCFG2 register; bits \b LCDON of \b
//! LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_on(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Turns the LCD_E off.
//!
//! This function turns the LCD_E off.
//!
//! \param baseAddress is the base address of the LCD_E module.
//!
//! Modified bits are \b LCDPCTL of \b SYSCFG2 register; bits \b LCDON of \b
//! LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_off(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Clears the LCD_E selected interrupt flags.
//!
//! This function clears the specified interrupt flags.
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param mask is the masked interrupt flag to be cleared.
//!        Mask value is the logical OR of any of the following:
//!        - \b LCD_E_BLINKING_SEGMENTS_ON_INTERRUPT
//!        - \b LCD_E_BLINKING_SEGMENTS_OFF_INTERRUPT
//!        - \b LCD_E_FRAME_INTERRUPT
//!        \n Modified bits are \b LCDBLKONIFG, \b LCDBLKOFFIFG and \b
//!        LCDFRMIFG of \b LCDCTL1 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_clearInterrupt(uint16_t baseAddress,
                                 uint16_t mask);

//*****************************************************************************
//
//! \brief Returns the status of the selected interrupt flags.
//!
//! This function returns the status of the selected interrupt flags.
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param mask is the masked interrupt flags.
//!        Mask value is the logical OR of any of the following:
//!        - \b LCD_E_BLINKING_SEGMENTS_ON_INTERRUPT
//!        - \b LCD_E_BLINKING_SEGMENTS_OFF_INTERRUPT
//!        - \b LCD_E_FRAME_INTERRUPT
//!
//! \return The current interrupt flag status for the corresponding mask.
//!         Return Logical OR of any of the following:
//!         - \b LCD_E_BLINKING_SEGMENTS_ON_INTERRUPT
//!         - \b LCD_E_BLINKING_SEGMENTS_OFF_INTERRUPT
//!         - \b LCD_E_FRAME_INTERRUPT
//!         \n indicating the status of the masked interrupts
//
//*****************************************************************************
extern uint16_t LCD_E_getInterruptStatus(uint16_t baseAddress,
                                         uint16_t mask);

//*****************************************************************************
//
//! \brief Enables selected LCD_E interrupt sources.
//!
//! This function enables the indicated LCD_E interrupt sources.
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param mask is the interrupts to be enabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b LCD_E_BLINKING_SEGMENTS_ON_INTERRUPT
//!        - \b LCD_E_BLINKING_SEGMENTS_OFF_INTERRUPT
//!        - \b LCD_E_FRAME_INTERRUPT
//!        \n Modified bits are \b LCDBLKONIE, \b LCDBLKOFFIE and \b LCDFRMIE
//!        of \b LCDCTL1 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_enableInterrupt(uint16_t baseAddress,
                                  uint16_t mask);

//*****************************************************************************
//
//! \brief Disables selected LCD_E interrupt sources.
//!
//! This function disables the indicated LCD_E interrupt sources.
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param mask is the interrupts to be disabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b LCD_E_BLINKING_SEGMENTS_ON_INTERRUPT
//!        - \b LCD_E_BLINKING_SEGMENTS_OFF_INTERRUPT
//!        - \b LCD_E_FRAME_INTERRUPT
//!        \n Modified bits are \b LCDBLKONIE, \b LCDBLKOFFIE and \b LCDFRMIE
//!        of \b LCDCTL1 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_disableInterrupt(uint16_t baseAddress,
                                   uint16_t mask);

//*****************************************************************************
//
//! \brief Clears all LCD_E memory registers.
//!
//! This function clears all LCD_E memory registers.
//!
//! \param baseAddress is the base address of the LCD_E module.
//!
//! Modified bits are \b LCDCLRM of \b LCDMEMCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_clearAllMemory(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Clears all LCD_E blinking memory registers.
//!
//! This function clears all LCD_E blinking memory registers.
//!
//! \param baseAddress is the base address of the LCD_E module.
//!
//! Modified bits are \b LCDCLRBM of \b LCDMEMCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_clearAllBlinkingMemory(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Selects display memory.
//!
//! This function selects display memory either from memory or blinking memory.
//! Please note if the blinking mode is selected as
//! LCD_E_BLINKMODE_INDIVIDUALSEGMENTS or LCD_E_BLINKMODE_ALLSEGMENTS or mux
//! rate >=5, display memory can not be changed. If
//! LCD_E_BLINKMODE_SWITCHDISPLAYCONTENTS is selected, display memory bit
//! reflects current displayed memory.
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param displayMemory is the desired displayed memory.
//!        Valid values are:
//!        - \b LCD_E_DISPLAYSOURCE_MEMORY [Default]
//!        - \b LCD_E_DISPLAYSOURCE_BLINKINGMEMORY
//!        \n Modified bits are \b LCDDISP of \b LCDMEMCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_selectDisplayMemory(uint16_t baseAddress,
                                      uint16_t displayMemory);

//*****************************************************************************
//
//! \brief Sets the blinking control register.
//!
//! This function sets the blink control related parameter, including blink
//! clock frequency prescalar and blink mode.
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param clockPrescalar is the clock pre-scalar for blinking frequency.
//!        Valid values are:
//!        - \b LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_4 [Default]
//!        - \b LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_8
//!        - \b LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_16
//!        - \b LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_32
//!        - \b LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_64
//!        - \b LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_128
//!        - \b LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_256
//!        - \b LCD_E_BLINK_FREQ_CLOCK_PRESCALAR_512
//!        \n Modified bits are \b LCDBLKPREx of \b LCDBLKCTL register.
//! \param mode is the select for blinking mode.
//!        Valid values are:
//!        - \b LCD_E_BLINK_MODE_DISABLED [Default]
//!        - \b LCD_E_BLINK_MODE_INDIVIDUAL_SEGMENTS
//!        - \b LCD_E_BLINK_MODE_ALL_SEGMENTS
//!        - \b LCD_E_BLINK_MODE_SWITCHING_BETWEEN_DISPLAY_CONTENTS
//!        \n Modified bits are \b LCDBLKMODx of \b LCDBLKCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_setBlinkingControl(uint16_t baseAddress,
                                     uint16_t clockPrescalar,
                                     uint16_t mode);

//*****************************************************************************
//
//! \brief Enables the charge pump.
//!
//! This function enables the charge pump and config the charge pump frequency.
//!
//! \param baseAddress is the base address of the LCD_E module.
//!
//! Modified bits are \b LCDCPEN of \b LCDVCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_enableChargePump(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Disables the charge pump.
//!
//! This function disables the charge pump.
//!
//! \param baseAddress is the base address of the LCD_E module.
//!
//! Modified bits are \b LCDCPEN of \b LCDVCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_disableChargePump(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Sets the charge pump frequency.
//!
//! This function sets the charge pump frequency. It takes effect once charge
//! pump is enabled by LCD_E_enableChargePump().
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param freq is the charge pump frequency to select.
//!        Valid values are:
//!        - \b LCD_E_CHARGEPUMP_FREQ_1 [Default]
//!        - \b LCD_E_CHARGEPUMP_FREQ_2
//!        - \b LCD_E_CHARGEPUMP_FREQ_3
//!        - \b LCD_E_CHARGEPUMP_FREQ_4
//!        - \b LCD_E_CHARGEPUMP_FREQ_5
//!        - \b LCD_E_CHARGEPUMP_FREQ_6
//!        - \b LCD_E_CHARGEPUMP_FREQ_7
//!        - \b LCD_E_CHARGEPUMP_FREQ_8
//!        - \b LCD_E_CHARGEPUMP_FREQ_9
//!        - \b LCD_E_CHARGEPUMP_FREQ_10
//!        - \b LCD_E_CHARGEPUMP_FREQ_11
//!        - \b LCD_E_CHARGEPUMP_FREQ_12
//!        - \b LCD_E_CHARGEPUMP_FREQ_13
//!        - \b LCD_E_CHARGEPUMP_FREQ_14
//!        - \b LCD_E_CHARGEPUMP_FREQ_15
//!        - \b LCD_E_CHARGEPUMP_FREQ_16
//!        \n Modified bits are \b LCDCPFSELx of \b LCDVCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_setChargePumpFreq(uint16_t baseAddress,
                                    uint16_t freq);

//*****************************************************************************
//
//! \brief Sets LCD_E voltage source.
//!
//! Two voltage sources are set in this function: R13 and R33. For the R13, the
//! voltage source can be either internal reference voltage or non internal
//! reference voltage (Vext or Vdd). For the R33, it can be external supply
//! voltage (Vext) or internal supply voltage (Vdd).
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param r13Source is the voltage source for R13.
//!        Valid values are:
//!        - \b LCD_E_NON_INTERNAL_REFERENCE_VOLTAGE [Default]
//!        - \b LCD_E_INTERNAL_REFERENCE_VOLTAGE
//!        \n Modified bits are \b LCDREFEN of \b LCDVCTL register.
//! \param r33Source is the voltage source for R33.
//!        Valid values are:
//!        - \b LCD_E_EXTERNAL_SUPPLY_VOLTAGE  [Default]
//!        - \b LCD_E_INTERNAL_SUPPLY_VOLTAGE
//!        \n Modified bits are \b LCDSELVDD of \b LCDVCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_setVLCDSource(uint16_t baseAddress,
                                uint16_t r13Source,
                                uint16_t r33Source);

//*****************************************************************************
//
//! \brief Sets LCD_E internal voltage for R13.
//!
//! This function sets the internal voltage for R13. The voltage is only
//! valuable when R13 voltage source is using internal reference voltage and
//! charge pump is enabled.
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param voltage is the charge pump select.
//!        Valid values are:
//!        - \b LCD_E_REFERENCE_VOLTAGE_2_60V [Default]
//!        - \b LCD_E_REFERENCE_VOLTAGE_2_66V
//!        - \b LCD_E_REFERENCE_VOLTAGE_2_72V
//!        - \b LCD_E_REFERENCE_VOLTAGE_2_78V
//!        - \b LCD_E_REFERENCE_VOLTAGE_2_84V
//!        - \b LCD_E_REFERENCE_VOLTAGE_2_90V
//!        - \b LCD_E_REFERENCE_VOLTAGE_2_96V
//!        - \b LCD_E_REFERENCE_VOLTAGE_3_02V
//!        - \b LCD_E_REFERENCE_VOLTAGE_3_08V
//!        - \b LCD_E_REFERENCE_VOLTAGE_3_14V
//!        - \b LCD_E_REFERENCE_VOLTAGE_3_20V
//!        - \b LCD_E_REFERENCE_VOLTAGE_3_26V
//!        - \b LCD_E_REFERENCE_VOLTAGE_3_32V
//!        - \b LCD_E_REFERENCE_VOLTAGE_3_38V
//!        - \b LCD_E_REFERENCE_VOLTAGE_3_44V
//!        - \b LCD_E_REFERENCE_VOLTAGE_3_50V
//!        \n Modified bits are \b VLCDx of \b LCDVCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_setVLCDVoltage(uint16_t baseAddress,
                                 uint16_t voltage);

//*****************************************************************************
//
//! \brief Sets the reference mode for R13.
//!
//! This function sets the reference mode for R13. In the switch mode, the Bias
//! Voltage Generator is on for 1 clock and off for 256 clock cycles to save
//! power. In the static mode, the Bias Voltage Generator is able to drive
//! larger LCD panels.
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param mode is the reference mode on R13.
//!        Valid values are:
//!        - \b LCD_E_REFERENCE_MODE_STATIC [Default]
//!        - \b LCD_E_REFERENCE_MODE_SWITCHED
//!        \n Modified bits are \b LCDREFMODE of \b LCDVCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_setReferenceMode(uint16_t baseAddress,
                                   uint16_t mode);

//*****************************************************************************
//
//! \brief Sets the LCD_E pins as LCD function pin.
//!
//! This function sets the LCD_E pins as LCD function pin.
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param pin is the select pin set as LCD function.
//!        Valid values are:
//!        - \b LCD_E_SEGMENT_LINE_0
//!        - \b LCD_E_SEGMENT_LINE_1
//!        - \b LCD_E_SEGMENT_LINE_2
//!        - \b LCD_E_SEGMENT_LINE_3
//!        - \b LCD_E_SEGMENT_LINE_4
//!        - \b LCD_E_SEGMENT_LINE_5
//!        - \b LCD_E_SEGMENT_LINE_6
//!        - \b LCD_E_SEGMENT_LINE_7
//!        - \b LCD_E_SEGMENT_LINE_8
//!        - \b LCD_E_SEGMENT_LINE_9
//!        - \b LCD_E_SEGMENT_LINE_10
//!        - \b LCD_E_SEGMENT_LINE_11
//!        - \b LCD_E_SEGMENT_LINE_12
//!        - \b LCD_E_SEGMENT_LINE_13
//!        - \b LCD_E_SEGMENT_LINE_14
//!        - \b LCD_E_SEGMENT_LINE_15
//!        - \b LCD_E_SEGMENT_LINE_16
//!        - \b LCD_E_SEGMENT_LINE_17
//!        - \b LCD_E_SEGMENT_LINE_18
//!        - \b LCD_E_SEGMENT_LINE_19
//!        - \b LCD_E_SEGMENT_LINE_20
//!        - \b LCD_E_SEGMENT_LINE_21
//!        - \b LCD_E_SEGMENT_LINE_22
//!        - \b LCD_E_SEGMENT_LINE_23
//!        - \b LCD_E_SEGMENT_LINE_24
//!        - \b LCD_E_SEGMENT_LINE_25
//!        - \b LCD_E_SEGMENT_LINE_26
//!        - \b LCD_E_SEGMENT_LINE_27
//!        - \b LCD_E_SEGMENT_LINE_28
//!        - \b LCD_E_SEGMENT_LINE_29
//!        - \b LCD_E_SEGMENT_LINE_30
//!        - \b LCD_E_SEGMENT_LINE_31
//!        - \b LCD_E_SEGMENT_LINE_32
//!        - \b LCD_E_SEGMENT_LINE_33
//!        - \b LCD_E_SEGMENT_LINE_34
//!        - \b LCD_E_SEGMENT_LINE_35
//!        - \b LCD_E_SEGMENT_LINE_36
//!        - \b LCD_E_SEGMENT_LINE_37
//!        - \b LCD_E_SEGMENT_LINE_38
//!        - \b LCD_E_SEGMENT_LINE_39
//!        - \b LCD_E_SEGMENT_LINE_40
//!        - \b LCD_E_SEGMENT_LINE_41
//!        - \b LCD_E_SEGMENT_LINE_42
//!        - \b LCD_E_SEGMENT_LINE_43
//!        - \b LCD_E_SEGMENT_LINE_44
//!        - \b LCD_E_SEGMENT_LINE_45
//!        - \b LCD_E_SEGMENT_LINE_46
//!        - \b LCD_E_SEGMENT_LINE_47
//!
//! Modified bits are \b LCDSx of \b LCDPCTLx register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_setPinAsLCDFunction(uint16_t baseAddress,
                                      uint8_t pin);

//*****************************************************************************
//
//! \brief Sets the LCD_E pins as port function pin.
//!
//! This function sets the LCD_E pins as port function pin.
//!
//! \param baseAddress is the base address of the LCD_E module.
//! \param pin is the select pin set as Port function.
//!        Valid values are:
//!        - \b LCD_E_SEGMENT_LINE_0
//!        - \b LCD_E_SEGMENT_LINE_1
//!        - \b LCD_E_SEGMENT_LINE_2
//!        - \b LCD_E_SEGMENT_LINE_3
//!        - \b LCD_E_SEGMENT_LINE_4
//!        - \b LCD_E_SEGMENT_LINE_5
//!        - \b LCD_E_SEGMENT_LINE_6
//!        - \b LCD_E_SEGMENT_LINE_7
//!        - \b LCD_E_SEGMENT_LINE_8
//!        - \b LCD_E_SEGMENT_LINE_9
//!        - \b LCD_E_SEGMENT_LINE_10
//!        - \b LCD_E_SEGMENT_LINE_11
//!        - \b LCD_E_SEGMENT_LINE_12
//!        - \b LCD_E_SEGMENT_LINE_13
//!        - \b LCD_E_SEGMENT_LINE_14
//!        - \b LCD_E_SEGMENT_LINE_15
//!        - \b LCD_E_SEGMENT_LINE_16
//!        - \b LCD_E_SEGMENT_LINE_17
//!        - \b LCD_E_SEGMENT_LINE_18
//!        - \b LCD_E_SEGMENT_LINE_19
//!        - \b LCD_E_SEGMENT_LINE_20
//!        - \b LCD_E_SEGMENT_LINE_21
//!        - \b LCD_E_SEGMENT_LINE_22
//!        - \b LCD_E_SEGMENT_LINE_23
//!        - \b LCD_E_SEGMENT_LINE_24
//!        - \b LCD_E_SEGMENT_LINE_25
//!        - \b LCD_E_SEGMENT_LINE_26
//!        - \b LCD_E_SEGMENT_LINE_27
//!        - \b LCD_E_SEGMENT_LINE_28
//!        - \b LCD_E_SEGMENT_LINE_29
//!        - \b LCD_E_SEGMENT_LINE_30
//!        - \b LCD_E_SEGMENT_LINE_31
//!        - \b LCD_E_SEGMENT_LINE_32
//!        - \b LCD_E_SEGMENT_LINE_33
//!        - \b LCD_E_SEGMENT_LINE_34
//!        - \b LCD_E_SEGMENT_LINE_35
//!        - \b LCD_E_SEGMENT_LINE_36
//!        - \b LCD_E_SEGMENT_LINE_37
//!        - \b LCD_E_SEGMENT_LINE_38
//!        - \b LCD_E_SEGMENT_LINE_39
//!        - \b LCD_E_SEGMENT_LINE_40
//!        - \b LCD_E_SEGMENT_LINE_41
//!        - \b LCD_E_SEGMENT_LINE_42
//!        - \b LCD_E_SEGMENT_LINE_43
//!        - \b LCD_E_SEGMENT_LINE_44
//!        - \b LCD_E_SEGMENT_LINE_45
//!        - \b LCD_E_SEGMENT_LINE_46
//!        - \b LCD_E_SEGMENT_LINE_47
//!
//! Modified bits are \b LCDSx of \b LCDPCTLx register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_E_setPinAsPortFunction(uint16_t baseAddress,
                                       uint8_t pin);

